# Kip Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Kip Property
SymbolTypeId Class See Also
---
Symbol kip, indicating unit Kips.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Kip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Kip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Kip {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace